app/Models/TypeOperationModel.php

    public function getAll()
    {
        return $this->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `type_operation`
ORDER BY `id` ASC