app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `telephone` = '0340000000'
 LIMIT 1
---
    public function findByTelephone(string $telephone): ?object
    {
        $result = $this->where('telephone', $telephone)->first();